# DataFrame

In [1]:
dados = {
    "Nome": [
        "João da Silva Santos",
        "Maria Aparecida Souza",
        "Igor Soares Costa",
    ],
    "Idade": [22, 35, 58],
    "Profissão": ["professor", "médica", "professor"],
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(dados)

df

                    Nome  Idade  Profissão
0   João da Silva Santos     22  professor
1  Maria Aparecida Souza     35     médica
2      Igor Soares Costa     58  professor

In [4]:
type(df)

pandas.core.frame.DataFrame

## Series

In [5]:
df["Nome"]

0     João da Silva Santos
1    Maria Aparecida Souza
2        Igor Soares Costa
Name: Nome, dtype: object

In [6]:
type(df["Nome"])

pandas.core.series.Series

Um DataFrame é um estrutura bidimensional com colunas de tipos potencialmente diferentes. Já uma Series é um array (vetor) unidimensional capaz de conter qualquer tipo de dados.

In [7]:
df[['Nome', 'Idade']]

                    Nome  Idade
0   João da Silva Santos     22
1  Maria Aparecida Souza     35
2      Igor Soares Costa     58

In [8]:
type(df[['Nome', 'Idade']])

pandas.core.frame.DataFrame

In [9]:
df[['Nome']]

                    Nome
0   João da Silva Santos
1  Maria Aparecida Souza
2      Igor Soares Costa

In [10]:
type(df[['Nome']])

pandas.core.frame.DataFrame

## Pequenas análises

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Nome       3 non-null      object
 1   Idade      3 non-null      int64
 2   Profissão  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [12]:
df.dtypes

Nome         object
Idade         int64
Profissão    object
dtype: object

In [13]:
df["Idade"].max()

58

In [14]:
df["Idade"].mean()

38.333333333333336

In [15]:
df.describe()

           Idade
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [16]:
df.describe(exclude="number")

                        Nome  Profissão
count                      3          3
unique                     3          2
top     João da Silva Santos  professor
freq                       1          2